package com.softserve.edu.task5;

public class ConstantSymbolicNames {
    public static final String MINUS = "минус";
    public static final String ZERO = "ноль";
    public static final String[] FIRST_DIGIT = {"", "один", "два", "три",
            "четыре", "пять", "шесть", "семь", "восемь", "девять"};

    public static final String[] TEN_TO_TWENTY = {"десять", "одиннадцать",
            "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать",
            "семнадцать", "восемнадцать", "девятнадцать"};

    public static final String[] TENS = {"", "", "двадцать",
            "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят",
            "восемьдесят", "девяносто"};

    public static final String[] HUNDREDS = {"", "сто", "двести", "триста",
            "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот",
            "девятьсот"};

    public static final String[] THOUSANDS = {"тысяч", "одна тысяча",
            "две тысячи", "три тысячи", "четыре тысячи", "пять тысяч",
            "шесть тысяч", "семь тысяч", "восемь тысяч", "девять тысяч"};

    public static final String[] TRIPLET_NAME = {"", "", "миллионов",
            "миллиардов", "триллионов", "квадриллионов", "квинтиллионов",
            "секситиллионов", "септиллионов", "октиллион", "нониллионов",
            "децилионов"};

}
